#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/29f30638-df70-45ed-9aec-174417248a91/terraform-bin show -no-color plan.tmp

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.project-factory["another-prod-project"].module.project-factory.google_project.main has changed
  ~ resource "google_project" "main" {
        id                  = "projects/another-prod-project-k187"
        name                = "another-prod-project"
      + number              = "1017763197222"
        # (3 unchanged attributes hidden)
    }

  # module.project-factory["net-shared-vpc-prod"].module.project-factory.google_project.main has changed
  ~ resource "google_project" "main" {
        id                  = "projects/net-shared-vpc-prod-ug2d"
        name                = "net-shared-vpc-prod"
      + number              = "195913458580"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.project-factory["another-prod-project"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "another-prod-project-k187"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["another-prod-project"].module.project-factory.google_project.main is tainted, so must be replaced
-/+ resource "google_project" "main" {
      + billing_account     = "01710A-17EA16-57FCD3"
      ~ id                  = "projects/another-prod-project-k187" -> (known after apply)
      - labels              = {} -> null
        name                = "another-prod-project"
      ~ number              = "1017763197222" -> (known after apply)
      + skip_delete         = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.project-factory["another-prod-project"].module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DEPRIVILEGE"
      + id               = (known after apply)
      + project          = "another-prod-project-k187"
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.project-factory["another-prod-project"].module.project-factory.google_resource_manager_lien.lien[0] will be created
  + resource "google_resource_manager_lien" "lien" {
      + create_time  = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + origin       = "project-factory"
      + parent       = (known after apply)
      + reason       = "Project Factory lien"
      + restrictions = [
          + "resourcemanager.projects.delete",
        ]
    }

  # module.project-factory["central-gcp-vpc-non-prod-37070"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "central-gcp-vpc-non-prod-37070"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["my-new-project"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "my-new-project-trw0"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["net-shared-vpc-prod"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "net-shared-vpc-prod-ug2d"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["net-shared-vpc-prod"].module.project-factory.google_compute_shared_vpc_host_project.shared_vpc_host[0] will be created
  + resource "google_compute_shared_vpc_host_project" "shared_vpc_host" {
      + id      = (known after apply)
      + project = "net-shared-vpc-prod-ug2d"
    }

  # module.project-factory["net-shared-vpc-prod"].module.project-factory.google_project.main is tainted, so must be replaced
-/+ resource "google_project" "main" {
      + billing_account     = "01710A-17EA16-57FCD3"
      ~ id                  = "projects/net-shared-vpc-prod-ug2d" -> (known after apply)
      - labels              = {} -> null
        name                = "net-shared-vpc-prod"
      ~ number              = "195913458580" -> (known after apply)
      + skip_delete         = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.project-factory["net-shared-vpc-prod"].module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DEPRIVILEGE"
      + id               = (known after apply)
      + project          = "net-shared-vpc-prod-ug2d"
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.project-factory["net-shared-vpc-prod"].module.project-factory.google_resource_manager_lien.lien[0] will be created
  + resource "google_resource_manager_lien" "lien" {
      + create_time  = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + origin       = "project-factory"
      + parent       = (known after apply)
      + reason       = "Project Factory lien"
      + restrictions = [
          + "resourcemanager.projects.delete",
        ]
    }

  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "new-luis-id"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["prod-project"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "prod-project-369617"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["net-shared-vpc-prod"].module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "net-shared-vpc-prod-ug2d"
      + service                    = "compute.googleapis.com"
    }

Plan: 8 to add, 0 to change, 2 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.project-factory["another-prod-project"].module.project-factory.google_project.main has changed%0A  ~ resource "google_project" "main" {%0A        id                  = "projects/another-prod-project-k187"%0A        name                = "another-prod-project"%0A      + number              = "1017763197222"%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.project-factory["net-shared-vpc-prod"].module.project-factory.google_project.main has changed%0A  ~ resource "google_project" "main" {%0A        id                  = "projects/net-shared-vpc-prod-ug2d"%0A        name                = "net-shared-vpc-prod"%0A      + number              = "195913458580"%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.project-factory["another-prod-project"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "another-prod-project-k187"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["another-prod-project"].module.project-factory.google_project.main is tainted, so must be replaced%0A-/+ resource "google_project" "main" {%0A      + billing_account     = "01710A-17EA16-57FCD3"%0A      ~ id                  = "projects/another-prod-project-k187" -> (known after apply)%0A      - labels              = {} -> null%0A        name                = "another-prod-project"%0A      ~ number              = "1017763197222" -> (known after apply)%0A      + skip_delete         = (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.project-factory["another-prod-project"].module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created%0A  + resource "google_project_default_service_accounts" "default_service_accounts" {%0A      + action           = "DEPRIVILEGE"%0A      + id               = (known after apply)%0A      + project          = "another-prod-project-k187"%0A      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"%0A      + service_accounts = (known after apply)%0A    }%0A%0A  # module.project-factory["another-prod-project"].module.project-factory.google_resource_manager_lien.lien[0] will be created%0A  + resource "google_resource_manager_lien" "lien" {%0A      + create_time  = (known after apply)%0A      + id           = (known after apply)%0A      + name         = (known after apply)%0A      + origin       = "project-factory"%0A      + parent       = (known after apply)%0A      + reason       = "Project Factory lien"%0A      + restrictions = [%0A          + "resourcemanager.projects.delete",%0A        ]%0A    }%0A%0A  # module.project-factory["central-gcp-vpc-non-prod-37070"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "central-gcp-vpc-non-prod-37070"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["my-new-project"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "my-new-project-trw0"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["net-shared-vpc-prod"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "net-shared-vpc-prod-ug2d"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["net-shared-vpc-prod"].module.project-factory.google_compute_shared_vpc_host_project.shared_vpc_host[0] will be created%0A  + resource "google_compute_shared_vpc_host_project" "shared_vpc_host" {%0A      + id      = (known after apply)%0A      + project = "net-shared-vpc-prod-ug2d"%0A    }%0A%0A  # module.project-factory["net-shared-vpc-prod"].module.project-factory.google_project.main is tainted, so must be replaced%0A-/+ resource "google_project" "main" {%0A      + billing_account     = "01710A-17EA16-57FCD3"%0A      ~ id                  = "projects/net-shared-vpc-prod-ug2d" -> (known after apply)%0A      - labels              = {} -> null%0A        name                = "net-shared-vpc-prod"%0A      ~ number              = "195913458580" -> (known after apply)%0A      + skip_delete         = (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.project-factory["net-shared-vpc-prod"].module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created%0A  + resource "google_project_default_service_accounts" "default_service_accounts" {%0A      + action           = "DEPRIVILEGE"%0A      + id               = (known after apply)%0A      + project          = "net-shared-vpc-prod-ug2d"%0A      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"%0A      + service_accounts = (known after apply)%0A    }%0A%0A  # module.project-factory["net-shared-vpc-prod"].module.project-factory.google_resource_manager_lien.lien[0] will be created%0A  + resource "google_resource_manager_lien" "lien" {%0A      + create_time  = (known after apply)%0A      + id           = (known after apply)%0A      + name         = (known after apply)%0A      + origin       = "project-factory"%0A      + parent       = (known after apply)%0A      + reason       = "Project Factory lien"%0A      + restrictions = [%0A          + "resourcemanager.projects.delete",%0A        ]%0A    }%0A%0A  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "new-luis-id"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["prod-project"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "prod-project-369617"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["net-shared-vpc-prod"].module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = true%0A      + id                         = (known after apply)%0A      + project                    = "net-shared-vpc-prod-ug2d"%0A      + service                    = "compute.googleapis.com"%0A    }%0A%0APlan: 8 to add, 0 to change, 2 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @token-generator-pull-request[bot], Action: `pull_request`, Working Directory: `/home/runner/work/project-factory/project-factory`, Workflow: `validate code`*